	var datas = [
		{	
			name : "鬥牛犬",
			recipe : {
				"伏特加" : 1.5,
				"葡萄柚汁" : "八分滿",
			},
			method : 1,
		},{	
			name : "",
			recipe : {
			},
			method : 1,
		},{	
			name : "(DM)Adonis",
			recipe : {
				"雪莉酒" : 4.5,
				"甜香艾酒" : 4.5,
				"苦精" : "2dashes",
			},
			method : 1,
		},{	
			name : "(DM)古夫風暴",
			recipe : {
				"伏特加" : "30ml",
				"蜜桃香甜酒" : "20ml",
				"藍柑橘香甜酒" : "10ml",
				"葡萄柚" : "50ml",
				"鳳梨汁" : "10ml",
			},
			method : 1,
		},{	
			name : "萊姆伏特加",
			recipe : {
				"伏特加" : 1.5,
				"萊姆汁" : 0.75,
			},
			method : 1,
		},{	
			name : "螺絲起子",
			recipe : {
				"伏特加" : 1,
				"柳橙汁" : "八分滿",
			},
			method : 1,
		},{	
			name : "橘花",
			recipe : {
				"琴酒" : 1,
				"柳橙汁" : 2,
			},
			method : 2,
		},{	
			name : "琴湯尼",
			recipe : {
				"琴酒" : 1.5,
				"通寧水" : "八分滿",
			},
			method : 1,
		},{	
			name : "自由古巴",
			recipe : {
				"蘭姆酒" : 1.5,
				"可樂" : "八分滿",
			},
			method : 1,
		},{	
			name : "加州之戀",
			recipe : {
				"蘭姆酒" : 1.5,
				"柳橙汁" : 2,
				"蘇打汽水" : "八分滿",
			},
			method : 1,
		},{	
			name : "海風",
			recipe : {
				"伏特加" : 0.75,
				"蔓越莓汁" : 1,
				"葡萄柚汁" : 1,
				"通寧水" : 0.5,
			},
			method : 1,
		},{	
			name : "鱈魚角",
			recipe : {
				"伏特加" : 1,
				"蔓越莓汁" : 1.5,
			},
			method : 2,
		},{	
			name : "神風特攻隊",
			recipe : {
				"伏特加" : 1.5,
				"橙酒" : 0.5,
				"萊姆汁" : 0.5,
			},
			method : 2,
		},{	
			name : "破冰船",
			recipe : {
				"龍舌蘭" : 1,
				"橙酒" : 0.5,
				"紅石榴糖漿" : "1 tsp",
				"葡萄柚汁" : 1,
			},
			method : 2,
		},{	
			name : "龍舌蘭日出",
			recipe : {
				"龍舌蘭" : 1,
				"紅石榴糖漿" : "2 tsp",
				"柳橙汁" : 3,
			},
			method : 1,
		},{	
			name : "琴蕾",
			recipe : {
				"琴酒" : 3,
				"萊姆汁" : 1,
			},
			method : 2,
		},{	
			name : "莫斯科騾子",
			recipe : {
				"伏特加" : 2,
				"萊姆汁" : 0.5 ,
				"薑汁汽水" : 3,
			},
			method : 1,
		},{	
			name : "伏特加通寧",
			recipe : {
				"伏特加" : 1,
				"通寧水" : 4,
			},
			method : 1,
		},{	
			name : "琴霸克",
			recipe : {
				"琴酒" : 1,
				"薑汁汽水" : 3,
			},
			method : 1,
		},{	
			name : "長島冰茶",
			recipe : {
				"琴酒" : 0.5,
				"伏特加" : 0.5,
				"龍舌蘭" : 0.5,
				"蘭姆酒" : 0.5,
				"橙酒" : 0.25,
				"萊姆汁" : 0.3,
				"檸檬汁" : 0.3,
				"可樂" : 1,
			},
			method : 1,
		},{	
			name : "愛爾蘭冰茶",
			recipe : {
				"琴酒" : 1,
				"伏特加" : 1,
				"龍舌蘭" : 1,
				"蘭姆酒" : 1,
				"藍柑橘香甜酒" : 1,
				"哈蜜瓜香甜酒" : 1,
				"柳橙汁" : 1.5,
			},
			method : 1,
		},{	
			name : "東京冰茶",
			recipe : {
				"琴酒" : 0.5,
				"伏特加" : 0.5,
				"龍舌蘭" : 0.5,
				"蘭姆酒" : 0.5,
				"橙酒" : 0.25,
				"萊姆汁" : 0.75,
				"檸檬汁" : 0.75,
				"七喜" : 1,
				"哈蜜瓜香甜酒" : 1,
			},
			method : 1,
		},{	
			name : "藍色珊瑚礁",
			recipe : {
				"伏特加" : 2,
				"藍柑橘香甜酒" : 0.5,
				"萊姆汁" : 1,
				"薑汁汽水" : "八分滿",
			},
			method : 1,
		},{	
			name : "騰空",
			recipe : {
				"琴酒" : 1,
				"伏特加" : 0.5,
				"藍柑橘香甜酒" : 0.5,
				"萊姆汁" : 0.5,
			},
			method : 2,
		},{	
			name : "波本可樂",
			recipe : {
				"波本威士忌" : 1.5,
				"可樂" : "八分滿",
			},
			method : 1,
		},{	
			name : "沉默的第三者",
			recipe : {
				"蘇格蘭威士忌" : 2,
				"橙酒" : 1,
				"檸檬汁" : 1,
			},
			method : 2,
		},{	
			name : "紐約",
			recipe : {
				"蘇格蘭威士忌" : 3,
				"紅石榴糖漿" : 0.5,
				"檸檬汁" : 1,
			},
			method : 2,
		},{	
			name : "海角樂園",
			recipe : {
				"伏特加" : 1,
				"蔓越莓汁" : 5,
			},
			method : 1,
		},{	
			name : "灰狗",
			recipe : {
				"伏特加" : 2,
				"柳橙汁" : 3,
			},
			method : 0,
		},{	
			name : "馬德拉斯",
			recipe : {
				"伏特加" : 1,
				"柳橙汁" : 1,
				"蔓越莓汁" : 4,
			},
			method : 0,
		},{	
			name : "高飛球",
			recipe : {
				"波本威士忌" : 2,
				"薑汁汽水" : 3,
			},
			method : 0,
		},{	
			name : "(DM)柯夢波丹",
			recipe : {
				"伏特加" : 3,
				"橙酒" : 1,
				"萊姆汁" : 0.5,
				"蔓越莓汁" : 2,
			},
			method : 2,
		},{	
			name : "側車",
			recipe : {
				"干邑白蘭地" : 3,
				"橙酒" : 1,
				"檸檬汁" : 1,
			},
			method : 2,
		},{	
			name : "床笫之間",
			recipe : {
				"蘭姆酒" : 1,
				"蘋果白蘭地" : 1,
				"橙酒" : 1,
				"柳橙汁" : "1 tsp",
			},
			method : 2,
		},{	
			name : "垂死的渾蛋",
			recipe : {
				"琴酒" : 1,
				"蘭姆酒" : 1,
				"蘋果白蘭地" : 1,
				"萊姆汁" : 0.5,
				"薑汁汽水" : 1,
			},
			method : 0,
		},{	
			name : "照葉樹林",
			recipe : {
				"綠茶香甜酒" : 2,
				"伏特加" : 1,
				"烏龍茶" : 3,
			},
			method : 0,
		},{	
			name : "黑色俄羅斯",
			recipe : {
				"咖啡香甜酒" : 2,
				"伏特加" : 5,
			},
			method : 0,
		},{	
			name : "卡魯哇牛奶",
			recipe : {
				"咖啡香甜酒" : 2,
				"牛奶" : 6,
			},
			method : 0,
		},{	
			name : "龍舌蘭炸彈",
			recipe : {
				"龍舌蘭" : 1,
				"蘇打汽水" : 3,
			},
			method : 3,
		},{	
			name : "轟炸機B52-Vodka",
			recipe : {
				"伏特加" : 1,
				"咖啡香甜酒" : 1,
				"奶酒" : 1,
			},
			method : 3,
		},{	
			name : "紫色夢幻",
			recipe : {
				"琴酒" : 1,
				"橙酒" : 1,
				"藍柑橘香甜酒" : 0.67,
				"紅石榴糖漿" : 0.67,
				"萊姆汁" : 0.5,
				"紅酒" : 0.5,
				"蘇打汽水" : "適量",
			},
			method : 1,
		},{	
			name : "巴拉萊卡",
			recipe : {
				"橙酒" : 4,
				"檸檬汁" : 1,
				"伏特加" : 1,
			},
			method : 2,
		},{	
			name : "白色佳人",
			recipe : {
				"橙酒" : 4,
				"檸檬汁" : 1,
				"琴酒" : 1,
			},
			method : 2,
		},{	
			name : "紅粉佳人",
			recipe : {
				"琴酒" : 1.5,
				"紅石榴糖漿" : 0.5,
				"蛋白" : "1顆",
			},
			method : 2,
		},{	
			name : "藍色佳人",
			recipe : {
				"琴酒" : 1,
				"藍柑橘香甜酒" : 1,
				"檸檬汁" : 0.5,
				"蛋白" : "1顆",
			},
			method : 2,
		},{	
			name : "瑪格麗特",
			recipe : {
				"橙酒" : 4,
				"檸檬汁" : 1,
				"龍舌蘭" : 1,
			},
			method : 2,
		},{	
			name : "XYZ",
			recipe : {
				"橙酒" : 4,
				"檸檬汁" : 1,
				"蘭姆酒" : 1,
			},
			method : 2,
		},{	
			name : "假啤酒",
			recipe : {
				"薑汁汽水" : 6,
				"啤酒" : 6,
			},
			method : 3,
		},{	
			name : "傑克羅斯",
			recipe : {
				"蘋果白蘭地" : 2,
				"萊姆汁" : 1,
				"紅石榴糖漿" : 1,
			},
			method : 2,
		},{	
			name : "夏之東京",
			recipe : {
				"葡萄汁" : 1.5,
				"梅酒" : 1,
				"可爾必思" : 1.5,
				"伏特加" : 1,
				"蘇打汽水" : "加滿",
			},
			method : 1,
		},{	
			name : "國王谷",
			recipe : {
				"蘇格蘭威士忌" : 2,
				"橙酒" : 0.5,
				"萊姆汁" : 0.5,
				"藍柑橘香甜酒" : "1tsp",
			},
			method : 2,
		},{	
			name : "橙果",
			recipe : {
				"橙酒" : 4,
				"檸檬汁" : 1,
				"萊姆汁" : 1,
			},
			method : 1,
		},{	
			name : "鬥牛士",
			recipe : {
				"龍舌蘭" : 3,
				"鳳梨汁" : 2,
				"檸檬汁" : 1,
			},
			method : 2,
		},{	
			name : "鬥牛士披風",
			recipe : {
				"龍舌蘭" : 1,
				"鳳梨汁" : 3,
				"萊姆汁" : 0.5,
			},
			method : 2,
		},{	
			name : "琴費斯",
			recipe : {
				"琴酒" : "40ml",
				"檸檬汁" : "20ml",
				"砂糖" : "2茶匙",
			},
			method : 2,
		},{	
			name : "紫雨",
			recipe : {
				"琴酒" : 0.5,
				"龍舌蘭" : 0.5,
				"白蘭姆酒" : 0.5,
				"紅石榴糖漿" : 0.5,
				"藍柑橘香甜酒" : 1,
				"伏特加" : 0.5,
				"蔓越莓汁" : 0.5,
			},
			method : 2,
		},{	
			name : "紫雨糖口杯",
			recipe : {
				"伏特加" : 1.5,
				"檸檬汁" : 3,
				"藍柑橘香甜酒" : 0.5,
				"紅石榴糖漿" : 0.25,
				"砂糖" : "杯口",
			},
			method : 2,
		},{	
			name : "沙漠巫醫",
			recipe : {
				"琴酒" : 1,
				"干邑白蘭地" : 0.5,
				"柳橙汁" : 2,
				"薑汁汽水" : 2,
			},
			method : 2,
		},{	
			name : "戈登紅寶石庫樂",
			recipe : {
				"琴酒" : 1,
				"蔓越莓汁" : 2,
				"薑汁汽水" : 1,
			},
			method : 1,
		},{	
			name : "柳橙費斯",
			recipe : {
				"琴酒" : "40ml",
				"柳橙汁" : "30ml",
				"檸檬汁" : "15ml",
				"砂糖" : "1茶匙",
				"蘇打汽水" : "九分滿",
			},
			method : 2,
		},{	
			name : "明天",
			recipe : {
				"琴酒" : 0.5,
				"波本威士忌" : 0.5,
				"龍舌蘭" : 0.5,
				"干邑白蘭地" : 0.5,
				"蘭姆酒" : 0.5,
				"伏特加" : 0.5,
			},
			method : 3,
		},{	
			name : "藍色星期一",
			recipe : {
				"伏特加" : 3,
				"橙酒" : 1,
				"藍柑橘香甜酒" : 0.5,
			},
			method : 2,
		},{	
			name : "巴拉萊卡糖口杯",
			recipe : {
				"伏特加" : 1,
				"橙酒" : 0.5,
				"檸檬汁" : 0.5,
			},
			method : 2,
		},{	
			name : "奇奇",
			recipe : {
				"伏特加" : "30ml",
				"鳳梨汁" : "40ml",
				"椰奶" : "20ml",
			},
			method : 2,
		},{	
			name : "大都會",
			recipe : {
				"伏特加" : "25ml",
				"橙酒" : "10ml",
				"萊姆汁" : "10ml",
				"蔓越莓汁" : "20ml",
			},
			method : 2,
		},{	
			name : "鹹狗鹽口杯",
			recipe : {
				"葡萄柚汁" : "100ml",
				"伏特加" : "40ml",
			},
			method : 2,
		},{	
			name : "百老匯醉鬼",
			recipe : {
				"龍舌蘭" : 1,
				"柳橙汁" : 0.5,
				"檸檬汁" : 0.5,
			},
			method : 2,
		},{	
			name : "墨西哥人",
			recipe : {
				"龍舌蘭" : 1,
				"鳳梨汁" : 1,
				"紅石榴糖漿" : "0.5c.c.",
			},
			method : 2,
		},{	
			name : "PlumSpread",
			recipe : {
				"梅酒" : 4,
				"蘇打汽水" : 4,
				"檸檬汁" : "適量",
			},
			method : 1,
		},{	
			name : "(DM)斯普莫尼",
			recipe : {
				"金巴利" : 2,
				"葡萄柚汁" : 3,
				"通寧水" : "加滿",
			},
			method : 1,
		},{	
			name : "金巴利蘇打",
			recipe : {
				"金巴利" : 1.5,
				"蘇打汽水" : "九分滿",
			},
			method : 1,
		},{	
			name : "金巴利柳橙",
			recipe : {
				"金巴利" : 1.5,
				"柳橙汁" : 1.5,
			},
			method : 1,
		},{	
			name : "日本木屐",
			recipe : {
				"哈蜜瓜香甜酒" : 1,
				"橙酒" : 1,
				"檸檬汁" : 1,
			},
			method : 2,
		},{	
			name : "彩虹Shots",
			recipe : {
				"草莓糖漿" : "30ml",
				"柳橙汁" : "210ml",
				"伏特加" : "40ml",
				"藍柑橘香甜酒" : "20ml",
			},
			method : 3,
		},{	
			name : "仿聲鳥",
			recipe : {
				"龍舌蘭" : 2,
				"綠薄荷酒" : 1,
				"萊姆汁" : 1,
			},
			method : 2,
		},{	
			name : "巴卡蒂",
			recipe : {
				"蘭姆酒" : 3,
				"萊姆汁" : 1,
				"紅石榴糖漿" : "1tsp",
			},
			method : 2,
		},{	
			name : "城市珊瑚",
			recipe : {
				"琴酒" : 1,
				"哈蜜瓜香甜酒" : 1,
				"葡萄柚汁" : 1,
				"藍柑橘香甜酒" : "1tsp",
				"通寧水" : "裝滿",
			},
			method : 1,
		},{	
			name : "綠寶石冰酒",
			recipe : {
				"琴酒" : 2,
				"綠薄荷酒" : 1,
				"檸檬汁" : 1,
				"糖漿" : "1tsp",
				"蘇打汽水" : "適量",
			},
			method : 2,
		},{	
			name : "綠茶威士忌",
			recipe : {
				"蘇格蘭威士忌" : 1,
				"綠茶" : 2,
				"糖漿" : "1tsp",
			},
			method : 1,
		},{	
			name : "夜間飛行",
			recipe : {
				"咖啡香甜酒" : 1,
				"伏特加" : 1,
				"牛奶" : 2,
				"可樂" : 1,
			},
			method : 1,
		},{	
			name : "日出清酒",
			recipe : {
				"清酒" : 1.5,
				"蘇打汽水" : 3.5,
				"紅石榴糖漿" : "1tsp",
			},
			method : 1,
		},{	
			name : "MidoriIllusion",
			recipe : {
				"哈蜜瓜香甜酒" : 2,
				"橙酒" : 0.5,
				"伏特加" : 0.5,
				"檸檬汁" : 1,
				"鳳梨汁" : 1,
			},
			method : 2,
		},{	
			name : "薄荷酷樂",
			recipe : {
				"綠薄荷酒" : 1,
				"蘇格蘭威士忌" : 3,
			},
			method : 1,
		},{	
			name : "亞歷山大姊妹",
			recipe : {
				"琴酒" : 1,
				"綠薄荷酒" : 1,
				"鮮奶油" : 1,
			},
			method : 2,
		},{	
			name : "鳳梨費士",
			recipe : {
				"白蘭姆酒" : "45ml",
				"鳳梨汁" : "20ml",
				"砂糖" : "1茶匙",
			},
			method : 1,
		},{	
			name : "熱帶日出",
			recipe : {
				"白蘭姆酒" : 1.5,
				"柳橙汁" : 1.5,
				"鳳梨汁" : 1.5,
				"檸檬汁" : 0.5,
				"紅石榴糖漿" : 1,
			},
			method : 2,
		},{	
			name : "宇宙珊瑚",
			recipe : {
				"白蘭姆酒" : 1,
				"草莓香甜酒" : 1,
				"葡萄柚汁" : 1,
				"紅石榴糖漿" : "1茶匙",
				"哈蜜瓜香甜酒" : "鹽杯用",
			},
			method : 1,
		},{	
			name : "仙蒂小姐_啤酒",
			recipe : {
				"啤酒" : 1,
				"七喜" : 1,
			},
			method : 1,
		},{	
			name : "絲襪",
			recipe : {
				"龍舌蘭" : 2,
				"白可可酒" : 1,
				"鮮奶油" : 1,
				"紅石榴糖漿" : "1tsp",
			},
			method : 2,
		},{	
			name : "心之旅",
			recipe : {
				"橙酒" : 1,
				"葡萄柚汁" : 1,
				"蔓越莓汁" : 1,
				"萊姆汁" : "1tsp",
			},
			method : 1,
		},{	
			name : "私人課程",
			recipe : {
				"荔枝香甜酒" : 1,
				"鳳梨汁" : 1,
				"通寧水" : "適量",
				"紅石榴糖漿" : "1tsp",
			},
			method : 1,
		},{	
			name : "灰姑娘的蜜月",
			recipe : {
				"荔枝香甜酒" : 2,
				"橙酒" : 1,
				"葡萄柚汁" : 2,
				"萊姆汁" : 1,
			},
			method : 1,
		},{	
			name : "即興酒",
			recipe : {
				"龍舌蘭" : 4,
				"藍柑橘香甜酒" : 1,
				"萊姆汁" : 1,
				"哈蜜瓜香甜酒" : "1茶匙",
			},
			method : 2,
		},{	
			name : "淡淡之交",
			recipe : {
				"竹葉青" : 2,
				"七喜" : 3,
				"糖漿" : "適量",
			},
			method : 1,
		},{	
			name : "親愛之酒",
			recipe : {
				"竹葉青" : 2.5,
				"蘭姆酒" : 1.5,
				"柳橙汁" : 1.5,
			},
			method : 2,
		},{	
			name : "環遊世界",
			recipe : {
				"琴酒" : 4,
				"綠薄荷酒" : 1,
				"鳳梨汁" : 1,
			},
			method : 2,
		},{	
			name : "TenderEight",
			recipe : {
				"琴酒" : 4,
				"橙酒" : 1,
				"萊姆汁" : 1,
				"綠茶香甜酒" : "1茶匙",
			},
			method : 2,
		},{	
			name : "仙蒂小姐_龍舌蘭",
			recipe : {
				"龍舌蘭" : 1.5,
				"哈蜜瓜香甜酒" : 1.5,
				"葡萄柚汁" : 5,
			},
			method : 2,
		},{	
			name : "加勒比海黎明",
			recipe : {
				"龍舌蘭" : 1,
				"椰奶香甜酒" : 1.5,
				"草莓糖漿" : 0.25,
				"草莓冰淇淋" : "1球",
			},
			method : 3,
		},{	
			name : "芭蕉",
			recipe : {
				"清酒" : 5,
				"綠茶香甜酒" : 1,
			},
			method : 1,
		},{	
			name : "淑女黛安娜",
			recipe : {
				"白蘭姆酒" : 2,
				"白可可酒" : 1,
				"藍柑橘香甜酒" : 1,
				"鮮奶油" : 2,
				"加利亞諾" : "1tsp",
				"白巧克力" : "少許裝飾用",
			},
			method : 2,
		},{	
			name : "毒蛇",
			recipe : {
				"龍舌蘭" : 1,
				"綠薄荷酒" : 1,
				"萊姆汁" : 2,
			},
			method : 2,
		},{	
			name : "回憶酒",
			recipe : {
				"白蘭姆酒" : 4,
				"Premier" : 1,
				"萊姆汁" : 1,
				"藍柑橘香甜酒" : "1茶匙",
			},
			method : 2,
		},{	
			name : "瀨戶的花嫁",
			recipe : {
				"清酒" : 3,
				"荔枝香甜酒" : 1,
				"橙酒" : 1,
				"柚子汁" : 1,
				"櫻桃" : "1顆裝飾用",
			},
			method : 2,
		},{	
			name : "沙漠玫瑰",
			recipe : {
				"龍舌蘭" : 1,
				"橙酒" : 0.5,
				"紅石榴糖漿" : 0.25,
				"萊姆汁" : 1,
				"糖漿" : 0.5,
				"鳳梨汁" : 4,
			},
			method : 2,
		},{	
			name : "邁泰",
			recipe : {
				"白蘭姆酒" : "45ml",
				"橙酒" : "15ml",
				"鳳梨汁" : "30ml",
				"柳橙汁" : "30ml",
				"檸檬汁" : "10ml",
				"紅石榴糖漿" : "10ml",
			},
			method : 2,
		},{	
			name : "AfterEight",
			recipe : {
				"咖啡香甜酒" : 1,
				"鮮奶油" : 1,
				"奶酒" : 1,
			},
			method : 1,
		},{	
			name : "MindEraser",
			recipe : {
				"咖啡香甜酒" : 1,
				"伏特加" : 1,
				"蘇打汽水" : 2,
			},
			method : 1,
		},{	
			name : "艦長",
			recipe : {
				"波本威士忌" : "40ml",
				"檸檬汁" : "20ml",
				"糖漿" : "1tsp",
				"苦精" : "2dash",
			},
			method : 2,
		},{	
			name : "地震",
			recipe : {
				"龍舌蘭" : "40ml",
				"紅石榴糖漿" : "20ml",
				"草莓" : "3顆",
				"苦精" : "3dash",
				"碎冰" : "打成冰沙",
			},
			method : 3,
		},{	
			name : "草莓亞歷山大",
			recipe : {
				"草莓香甜酒" : 1,
				"鮮奶油" : 1,
				"白可可酒" : 1,
			},
			method : 2,
		},{	
			name : "坦奎利之森",
			recipe : {
				"琴酒" : "20ml",
				"哈蜜瓜香甜酒" : "10ml",
				"葡萄柚汁" : "25ml",
				"檸檬汁" : "5ml",
				"苦精" : "1dash",
			},
			method : 2,
		},{	
			name : "干邑雞尾酒",
			recipe : {
				"干邑白蘭地" : 1,
				"檸檬汁" : 1,
				"橙酒" : "1dash",
				"苦精" : "1dash",
			},
			method : 1,
		},{	
			name : "卡薩布蘭加",
			recipe : {
				"白蘭姆酒" : "40ml",
				"鳳梨汁" : "60ml",
				"椰奶" : "20ml",
				"紅石榴糖漿" : "2dash",
				"苦精" : "1dash",
				"碎冰" : "打成冰沙",
			},
			method : 3,
		},{	
			name : "黃金螺絲",
			recipe : {
				"琴酒" : 2,
				"柳橙汁" : 5,
				"苦精" : "1dash",
			},
			method : 1,
		},{	
			name : "牛頓特調",
			recipe : {
				"干邑白蘭地" : 3,
				"橙酒" : 1,
				"苦精" : "1dash",
			},
			method : 3,
		},{	
			name : "芭芭列娜",
			recipe : {
				"苦精" : "4dash",
				"草莓糖漿" : "1tsp",
				"葡萄柚汁" : "適量",
			},
			method : 1,
		},{	
			name : "牽絆",
			recipe : {
				"干邑白蘭地" : "45ml",
				"橙酒" : "20ml",
				"白可可酒" : "15ml",
				"苦精" : "1dash",
			},
			method : 2,
		},{	
			name : "強尼茱莉普",
			recipe : {
				"檸檬汁" : "40ml",
				"糖漿" : "1tsp",
				"苦精" : "2dash",
				"薑汁汽水" : "適量",
			},
			method : 1,
		},{	
			name : "日本天皇",
			recipe : {
				"干邑白蘭地" : "55ml",
				"白可可酒" : "1tsp",
				"橙酒" : "1tsp",
				"糖漿" : "1tsp",
				"苦精" : "2dash",
			},
			method : 2,
		},{	
			name : "帕帕基娜",
			recipe : {
				"金可可酒" : 2,
				"干邑白蘭地" : 1,
				"鮮奶油" : 1,
			},
			method : 2,
		},{	
			name : "柳橙干邑",
			recipe : {
				"干邑白蘭地" : 1,
				"柳橙汁" : 2,
			},
			method : 1,
		},{	
			name : "嗡嗡嗡",
			recipe : {
				"干邑白蘭地" : 2,
				"蜂蜜" : 1,
				"鮮奶油" : 1,
			},
			method : 2,
		},{	
			name : "甜蜜伊甸園",
			recipe : {
				"干邑白蘭地" : "30ml",
				"咖啡香甜酒" : "15ml",
				"藍柑橘香甜酒" : "5ml",
				"柳橙汁" : "10ml",
			},
			method : 2,
		},{	
			name : "伏特加馬丁尼",
			recipe : {
				"甜香艾酒" : 1,
				"伏特加" : 3,
				"苦精" : "1dash",
			},
			method : 2,
		},{	
			name : "美國佬",
			recipe : {
				"金巴利" : 1,
				"香艾酒" : 1,
				"蘇打汽水" : "加滿",
			},
			method : 1,
		},{	
			name : "血腥瑪麗",
			recipe : {
				"伏特加" : "45ml",
				"番茄汁" : "120ml",
				"檸檬汁" : "15ml",
				"伍斯特醬" : "2dashes",
				"Tabasco辣醬" : "2dashes",
				"胡椒" : "少許",
			},
			method : 3,
		},{	
			name : "曼哈頓",
			recipe : {
				"波本威士忌" : 3,
				"甜香艾酒" : 1,
				"苦精" : "2dash",
			},
			method : 2,
		},{	
			name : "蘋果馬丁尼",
			recipe : {
				"伏特加" : 1,
				"雪檸檬" : 1,
				"青蘋果香甜酒" : 1,
			},
			method : 2,
		},{	
			name : "杏仁酸酒",
			recipe : {
				"杏仁香甜酒" : 3,
				"雪檸檬" : 2,
			},
			method : 2,
		},{	
			name : "花花公子",
			recipe : {
				"波本威士忌" : "20ml",
				"甜香艾酒" : "15ml",
				"金巴利" : "15ml",
			},
			method : 2,
		},{	
			name : "威士忌酸酒",
			recipe : {
				"威士忌" : 2,
				"檸檬汁" : 1,
				"糖漿" : 0.75,
				"蘋果香甜酒" : 0.7,
				"蛋白" : "1顆",
			},
			method : 2,
		},{	
			name : "(DM)黑醋栗烏龍",
			recipe : {
				"黑醋栗香甜酒" : 1,
				"烏龍茶" : 3,
			},
			method : 1,
		},{	
			name : "鳳梨杏仁酸酒",
			recipe : {
				"杏仁香甜酒" : 3,
				"鳳梨汁" : 2,
				"雪檸檬" : 2,
				"雪碧" : "加到滿",
			},
			method : 1,
		},{	
			name : "巴黎人",
			recipe : {
				"黑醋栗香甜酒" : 1,
				"不甜香艾酒" : 1,
				"琴酒" : 1,
			},
			method : 2,
		},{	
			name : "布希球",
			recipe : {
				"杏仁香甜酒" : 1,
				"柳橙汁" : 1,
				"蘇打汽水" : "加滿",
			},
			method : 1,
		},{	
			name : "高潮",
			recipe : {
				"咖啡香甜酒" : "20ml",
				"奶酒" : "20ml",
				"杏仁香甜酒" : "15ml",
				"牛奶" : "15ml",
				"鮮奶油" : "15ml",
			},
			method : 2,
		},{	
			name : "咖啡馬丁尼",
			recipe : {
				"咖啡香甜酒" : 3,
				"伏特加" : 2,
				"濃縮咖啡" : 2,
				"糖漿" : 0.5,
			},
			method : 2,
		},{	
			name : "阿拉巴馬監獄",
			recipe : {
				"琴酒" : 1,
				"杏仁香甜酒" : 1,
				"蜜桃香甜酒" : 1,
				"柳橙汁" : 2,
			},
			method : 2,
		},{	
			name : "教父",
			recipe : {
				"蘇格蘭威士忌" : 3,
				"杏仁香甜酒" : 1,
			},
			method : 1,
		},{	
			name : "教母",
			recipe : {
				"伏特加" : 3,
				"杏仁香甜酒" : 1,
			},
			method : 1,
		},{	
			name : "法蘭西集團",
			recipe : {
				"白蘭地" : 3,
				"杏仁香甜酒" : 1,
			},
			method : 1,
		},{	
			name : "邁泰Mocktail",
			recipe : {
				"鳳梨汁" : 4,
				"蔓越莓" : 4,
				"杏仁糖漿" : 0.5,
				"檸檬汁" : 0.5,
			},
			method : 1,
		},{	
			name : "黑魔女冰茶",
			recipe : {
				"伏特加" : 0.5,
				"蘭姆酒" : 0.5,
				"琴酒" : 0.5,
				"龍舌蘭" : 0.5,
				"藍柑橘香甜酒" : 0.5,
				"紅石榴糖漿" : "1大匙",
				"雪檸檬" : "1小匙",
				"七喜" : "加滿",
			},
			method : 2,
		},{	
			name : "(DM)戴克瑞",
			recipe : {
				"蘭姆酒" : 3,
				"萊姆汁" : 1,
				"砂糖" : "1tsp",
			},
			method : 2,
		},{	
			name : "(DM)卡迪那",
			recipe : {
				"紅酒" : 4,
				"黑醋栗香甜酒" : 1,
			},
			method : 1,
		},{	
			name : "(DM)Misty Nail",
			recipe : {
				"愛爾蘭威士忌" : 2,
				"愛爾蘭之霧" : 1,
			},
			method : 1,
		},{	
			name : "(DM)Rosa Rossa",
			recipe : {
				"紅酒" : 2,
				"杏仁香甜酒" : 1,
				"薑汁汽水" : 1,
			},
			method : 1,
		},{	
			name : "(DM)馬里布",
			recipe : {
				"馬里布" : 1,
				"鳳梨汁" : 1,
				"牛奶" : 1,
			},
			method : 2,
		},{	
			name : "(DM)黑醋栗蘇打",
			recipe : {
				"黑醋栗香甜酒" : 1,
				"蘇打汽水" : 2.5,
			},
			method : 1,
		},{	
			name : "(DM)鳳梨可樂達",
			recipe : {
				"蘭姆酒" : 1,
				"椰漿" : 1,
				"鳳梨汁" : 3,
			},
			method : 2,
		},{	
			name : "(DM)馬丁尼",
			recipe : {
				"琴酒" : 6,
				"不甜香艾酒" : 1,
			},
			method : 2,
		},{	
			name : "(DM)藍色莫西多",
			recipe : {
				"藍柑橘香甜酒" : "5ml",
				"蘭姆酒" : "30ml",
				"萊姆汁" : "10ml",
				"蘇打汽水" : "130ml",
				"薄荷葉" : "4片",
			},
			method : 1,
		}/*,{	
			name : "",
			recipe : {
				"" : "",
				"" : "",
				"" : "",
				"" : "",
			},
			method : ,
		},{	
			name : "",
			recipe : {
				"" : "",
				"" : "",
				"" : "",
				"" : "",
			},
			method : ,
		},{	
			name : "",
			recipe : {
				"" : "",
				"" : "",
				"" : "",
				"" : "",
			},
			method : ,
		},{	
			name : "",
			recipe : {
				"" : "",
				"" : "",
				"" : "",
				"" : "",
			},
			method : ,
		},{	
			name : "",
			recipe : {
				"" : "",
				"" : "",
				"" : "",
				"" : "",
			},
			method : ,
		},{	
			name : "",
			recipe : {
				"" : "",
				"" : "",
				"" : "",
				"" : "",
			},
			method : ,
		},{	
			name : "",
			recipe : {
				"" : "",
				"" : "",
				"" : "",
				"" : "",
			},
			method : ,
		},{	
			name : "",
			recipe : {
				"" : "",
				"" : "",
				"" : "",
				"" : "",
			},
			method : ,
		},{	
			name : "",
			recipe : {
				"" : "",
				"" : "",
				"" : "",
				"" : "",
			},
			method : ,
		},{	
			name : "",
			recipe : {
				"" : "",
				"" : "",
				"" : "",
				"" : "",
			},
			method : ,
		}
		*/
	];
	
	var sourceList = {
		
		"基酒" : [
			"伏特加",
			"琴酒",
			"蘭姆酒",
			"白蘭姆酒",
			"橙酒",
			"龍舌蘭",
			"波本威士忌",
			"蘇格蘭威士忌",
			"愛爾蘭威士忌",
			"愛爾蘭之霧",
			"干邑白蘭地",
			"蘋果白蘭地",
			"紅酒",
			"清酒",
			"啤酒",
			"竹葉青",
			"Premier",
			"苦精",
			"雪莉酒",
		],
		
		"香甜酒" : [
			"藍柑橘香甜酒",
			"哈蜜瓜香甜酒",
			"咖啡香甜酒",
			"奶酒",
			"金巴利",
			"綠茶香甜酒",
			"椰奶香甜酒",
			"白可可酒",
			"金可可酒",
			"草莓香甜酒",
			"荔枝香甜酒",
			"加利亞諾",
			"梅酒",
			"綠薄荷酒",
			"甜香艾酒",
			"不甜香艾酒",
			"青蘋果香甜酒",
			"黑醋栗香甜酒",
			"杏仁香甜酒",
			"蜜桃香甜酒",
		],

		"果汁" : [
			"葡萄柚汁",
			"萊姆汁",
			"柳橙汁",
			"檸檬汁",
			"葡萄汁",
			"鳳梨汁",
			"柚子汁",
			"蔓越莓汁",
		],

		"汽水" : [
			"通寧水",
			"可樂",
			"蘇打汽水",
			"薑汁汽水",
			"七喜",
		],
		
		"其他副材料" : [
			"紅石榴糖漿",
			"烏龍茶",
			"牛奶",
			"蛋白",
			"可爾必思",
			"砂糖",
			"椰奶",
			"草莓糖漿",
			"糖漿",
			"綠茶",
			"鮮奶油",
			"草莓冰淇淋",
			"白巧克力",
			"櫻桃",
			"草莓",
			"碎冰",
			"蜂蜜",	
			"伍斯特醬",	
			"Tabasco辣醬",	
			"雪檸檬",
			"濃縮咖啡",
			"杏仁糖漿",
			"薄荷葉",
		]
		
	};